src/ldk-3.0.org
#+TITLE: Release notes for LDK 3.0
#+AUTHOR: VLEAD
#+DATE: [2016-08-31 Wed]
#+SETUPFILE: ./org-templates/level-0.org
#+TAGS: boilerplate(b)
#+EXCLUDE_TAGS: boilerplate
#+OPTIONS: ^:nil

* Introduction
There is no 3.0 kit released officially.  But all the
components that make up the kit (refer /[[https://drive.google.com/file/d/0ByhNY8nO_CW3T3kyWXR1Q0NFN2s/view?usp=sharing][DPR]]/ page 11) are
achieved independently and tracked by a repository on
github.

* Auto Deployment 3.0
:PROPERTIES:
:CUSTOM_ID: autodeployment
:END:
Release 3.0 supports multiple operating systems for
deployment of applications.  Until this release ADS
supported multiple flavors of =Ubuntu=.  With this release,
deployment of applications is supported on virtual machines
running =Centos= operating system.  For more details refer
to the /[[https://github.com/vlead/ovpl/releases/tag/v1.4.0][release]]/ /[[https://github.com/vlead/ovpl/releases/tag/v1.4.0][notes]]/ of the /[[https://github.com/vlead/ovpl/releases/tag/v1.4.0][OVPL 3.0]]/ /[[https://github.com/vlead/ovpl/releases/tag/v1.4.0][release]]/.

* Web 3.0 Compliance
:PROPERTIES:
:CUSTOM_ID: webcompliance
:END:
The /[[https://github.com/openedx-vlead/port-labs-to-openedx/releases/tag/v1.1.0][release]]/ contains the documentation and software to port
labs to Open edX platform.  Once a lab is ported to Open edX
platform, the lab becomes responsive.  For more details
refer to the /[[https://github.com/openedx-vlead/port-labs-to-openedx/releases/tag/v1.1.0][release]]/ /[[https://github.com/openedx-vlead/port-labs-to-openedx/releases/tag/v1.1.0][notes]]/ of the /[[https://github.com/openedx-vlead/port-labs-to-openedx/releases/tag/v1.1.0][Web Compliance 3.0]]/
/[[https://github.com/vlead/ovpl/releases/tag/v1.4.0][release]]/.

* Analytics 3.0
:PROPERTIES:
:CUSTOM_ID: analytics
:END:
The /[[https://github.com/vlead/analytics-db/releases/tag/v1.0.0][analytics]]/ service is developed that exposes a set of
API to display usage and hits of Virtual Labs.  This server
stores usage information from the Open edX platform.  For
more details refer to the /[[https://github.com/vlead/analytics-db/releases/tag/v1.0.0][release]]/ /[[https://github.com/vlead/analytics-db/releases/tag/v1.0.0][notes]]/ of the /[[https://github.com/vlead/analytics-db/releases/tag/v1.0.0][Analytics]]/
/[[https://github.com/vlead/analytics-db/releases/tag/v1.0.0][release]]/.

* Secutiy Framework 3.0
:PROPERTIES:
:CUSTOM_ID: securityframework
:END:
All labs at integration levels 5 & 6 are deployed on AWS
cloud.  The cloud is designed in such a way that the virtual
machines hosting the labs are not accessible to the outside
world.  A layer of security is built on top of these VMs
such that the traffic is directed through a single machine
called =router=.

* Persistence API 3.0
:PROPERTIES:
:CUSTOM_ID: persistence
:END:
/[[https://vlabs.ac.in][Over 90 labs]]/ are ported to Open edX /[[https://vlabs.ac.in][platform]]/.  The
platform provides persistence where the user in a new
session is moved to the same section that he/she has
accessed in the previous session.  The procedure to setup
the platform and port virtual labs to the platforms is part
of a /[[https://github.com/openedx-vlead/port-labs-to-openedx/blob/develop/src][repository]]/ on /[[https://github.com/openedx-vlead/port-labs-to-openedx/blob/develop/src][github]]/.  For more details refer to
the /[[https://github.com/openedx-vlead/port-labs-to-openedx/releases/tag/v1.1.0][release]]/ /[[https://github.com/openedx-vlead/port-labs-to-openedx/releases/tag/v1.1.0][notes]]/ of the /[[https://github.com/openedx-vlead/port-labs-to-openedx/releases/tag/v1.1.0][Persistence 3.0]]/ /[[https://github.com/openedx-vlead/port-labs-to-openedx/releases/tag/v1.1.0][release]]/.

* Performance 3.0
:PROPERTIES:
:CUSTOM_ID: performance
:END:
As part of the performance improvement of the platform and
therefore the Virtual Labs, Central Platform Engineering has
automated the /[[https://github.com/vlead/cluster-automation/releases][creation of the cluster]]/ from a configuration.
The CPE team has also tabulated the performance metrics for
different configurations - CPU, RAM, load etc., by /[[https://github.com/openedx-vlead/cc-pf-tests][designing]]/
a series of /[[https://github.com/openedx-vlead/cc-pf-tests][performance tests]]/.

* Packaging 3.0
:PROPERTIES:
:CUSTOM_ID: packaging
:END:
College Cloud edition of Virtual Labs is /[[https://github.com/openedx-vlead/college-cloud/releases/tag/v2.0.0][released]]/.  This
edition contains /[[https://github.com/openedx-vlead/college-cloud/blob/v2.0.0/src/labs-on-college-cloud/list-of-labs-in-college-cloud.org][73]]/ labs.  For more details refer to the
/[[https://github.com/openedx-vlead/college-cloud/releases/tag/v2.0.0][release]]/ /[[https://github.com/openedx-vlead/college-cloud/releases/tag/v2.0.0][notes]]/ of the /[[https://github.com/openedx-vlead/college-cloud/releases/tag/v2.0.0][Packaging 3.0]]/ /[[https://github.com/openedx-vlead/college-cloud/releases/tag/v2.0.0][release]]/.

* FOSS 3.0
:PROPERTIES:
:CUSTOM_ID: foss
:END:
Inputs from IIT Bombay ar awaited.
