src/ldk-3.0.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-09-01 Fri 18:09 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>Release notes for LDK 3.0</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="VLEAD VLEAD" />
<link rel="stylesheet" type="text/css" href="./style/css/worg-style.css" />
<link rel="stylesheet" type="text/css" href="./style/css/override.css" />
<link rel="icon" type="image/png" href="./style/img/favicon/popl.png" />

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./index.html"> UP </a>
 |
 <a accesskey="H" href="./index.html"> HOME </a>
</div><div id="content">
<h1 class="title">Release notes for LDK 3.0</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">1. Introduction</a></li>
<li><a href="#autodeployment">2. Auto Deployment 3.0</a></li>
<li><a href="#webcompliance">3. Web 3.0 Compliance</a></li>
<li><a href="#analytics">4. Analytics 3.0</a></li>
<li><a href="#securityframework">5. Secutiy Framework 3.0</a></li>
<li><a href="#persistence">6. Persistence API 3.0</a></li>
<li><a href="#performance">7. Performance 3.0</a></li>
<li><a href="#packaging">8. Packaging 3.0</a></li>
<li><a href="#foss">9. FOSS 3.0</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
There is no 3.0 kit released officially.  But all the
components that make up the kit (refer <a href="https://drive.google.com/file/d/0ByhNY8nO_CW3T3kyWXR1Q0NFN2s/view?usp=sharing"><i>DPR</i></a> page 11) are
achieved independently and tracked by a repository on
github.
</p>
</div>
</div>

<div id="outline-container-orgheadline2" class="outline-2">
<h2 id="autodeployment"><a id="orgheadline2"></a><span class="section-number-2">2</span> Auto Deployment 3.0</h2>
<div class="outline-text-2" id="text-autodeployment">
<p>
Release 3.0 supports multiple operating systems for
deployment of applications.  Until this release ADS
supported multiple flavors of <code>Ubuntu</code>.  With this release,
deployment of applications is supported on virtual machines
running <code>Centos</code> operating system.  For more details refer
to the <a href="https://github.com/vlead/ovpl/releases/tag/v1.4.0"><i>release</i></a> <a href="https://github.com/vlead/ovpl/releases/tag/v1.4.0"><i>notes</i></a> of the <a href="https://github.com/vlead/ovpl/releases/tag/v1.4.0">OVPL 3.0</a> <a href="https://github.com/vlead/ovpl/releases/tag/v1.4.0">release</a>.
</p>
</div>
</div>

<div id="outline-container-orgheadline3" class="outline-2">
<h2 id="webcompliance"><a id="orgheadline3"></a><span class="section-number-2">3</span> Web 3.0 Compliance</h2>
<div class="outline-text-2" id="text-webcompliance">
<p>
The <a href="https://github.com/openedx-vlead/port-labs-to-openedx/releases/tag/v1.1.0">release</a> contains the documentation and software to port
labs to Open edX platform.  Once a lab is ported to Open edX
platform, the lab becomes responsive.  For more details
refer to the <a href="https://github.com/openedx-vlead/port-labs-to-openedx/releases/tag/v1.1.0"><i>release</i></a> <a href="https://github.com/openedx-vlead/port-labs-to-openedx/releases/tag/v1.1.0"><i>notes</i></a> of the <a href="https://github.com/openedx-vlead/port-labs-to-openedx/releases/tag/v1.1.0">Web Compliance 3.0</a>
<a href="https://github.com/vlead/ovpl/releases/tag/v1.4.0">release</a>.
</p>
</div>
</div>

<div id="outline-container-orgheadline4" class="outline-2">
<h2 id="analytics"><a id="orgheadline4"></a><span class="section-number-2">4</span> Analytics 3.0</h2>
<div class="outline-text-2" id="text-analytics">
<p>
The <a href="https://github.com/vlead/analytics-db/releases/tag/v1.0.0"><i>analytics</i></a> service is developed that exposes a set of
API to display usage and hits of Virtual Labs.  This server
stores usage information from the Open edX platform.  For
more details refer to the <a href="https://github.com/vlead/analytics-db/releases/tag/v1.0.0"><i>release</i></a> <a href="https://github.com/vlead/analytics-db/releases/tag/v1.0.0"><i>notes</i></a> of the <a href="https://github.com/vlead/analytics-db/releases/tag/v1.0.0">Analytics</a>
<a href="https://github.com/vlead/analytics-db/releases/tag/v1.0.0">release</a>.
</p>
</div>
</div>

<div id="outline-container-orgheadline5" class="outline-2">
<h2 id="securityframework"><a id="orgheadline5"></a><span class="section-number-2">5</span> Secutiy Framework 3.0</h2>
<div class="outline-text-2" id="text-securityframework">
<p>
All labs at integration levels 5 &amp; 6 are deployed on AWS
cloud.  The cloud is designed in such a way that the virtual
machines hosting the labs are not accessible to the outside
world.  A layer of security is built on top of these VMs
such that the traffic is directed through a single machine
called <code>router</code>.
</p>
</div>
</div>

<div id="outline-container-orgheadline6" class="outline-2">
<h2 id="persistence"><a id="orgheadline6"></a><span class="section-number-2">6</span> Persistence API 3.0</h2>
<div class="outline-text-2" id="text-persistence">
<p>
<a href="https://vlabs.ac.in/"><i>Over 90 labs</i></a> are ported to Open edX <a href="https://vlabs.ac.in/"><i>platform</i></a>.  The
platform provides persistence where the user in a new
session is moved to the same section that he/she has
accessed in the previous session.  The procedure to setup
the platform and port virtual labs to the platforms is part
of a <a href="https://github.com/openedx-vlead/port-labs-to-openedx/blob/develop/src"><i>repository</i></a> on <a href="https://github.com/openedx-vlead/port-labs-to-openedx/blob/develop/src"><i>github</i></a>.  For more details refer to
the <a href="https://github.com/openedx-vlead/port-labs-to-openedx/releases/tag/v1.1.0"><i>release</i></a> <a href="https://github.com/openedx-vlead/port-labs-to-openedx/releases/tag/v1.1.0"><i>notes</i></a> of the <a href="https://github.com/openedx-vlead/port-labs-to-openedx/releases/tag/v1.1.0">Persistence 3.0</a> <a href="https://github.com/openedx-vlead/port-labs-to-openedx/releases/tag/v1.1.0">release</a>.
</p>
</div>
</div>

<div id="outline-container-orgheadline7" class="outline-2">
<h2 id="performance"><a id="orgheadline7"></a><span class="section-number-2">7</span> Performance 3.0</h2>
<div class="outline-text-2" id="text-performance">
<p>
As part of the performance improvement of the platform and
therefore the Virtual Labs, Central Platform Engineering has
automated the <a href="https://github.com/vlead/cluster-automation/releases">creation of the cluster</a> from a configuration.
The CPE team has also tabulated the performance metrics for
different configurations - CPU, RAM, load etc., by <a href="https://github.com/openedx-vlead/cc-pf-tests">designing</a>
a series of <a href="https://github.com/openedx-vlead/cc-pf-tests">performance tests</a>.
</p>
</div>
</div>

<div id="outline-container-orgheadline8" class="outline-2">
<h2 id="packaging"><a id="orgheadline8"></a><span class="section-number-2">8</span> Packaging 3.0</h2>
<div class="outline-text-2" id="text-packaging">
<p>
College Cloud edition of Virtual Labs is <a href="https://github.com/openedx-vlead/college-cloud/releases/tag/v2.0.0">released</a>.  This
edition contains <a href="https://github.com/openedx-vlead/college-cloud/blob/v2.0.0/src/labs-on-college-cloud/list-of-labs-in-college-cloud.org">73</a> labs.  For more details refer to the
<a href="https://github.com/openedx-vlead/college-cloud/releases/tag/v2.0.0"><i>release</i></a> <a href="https://github.com/openedx-vlead/college-cloud/releases/tag/v2.0.0"><i>notes</i></a> of the <a href="https://github.com/openedx-vlead/college-cloud/releases/tag/v2.0.0">Packaging 3.0</a> <a href="https://github.com/openedx-vlead/college-cloud/releases/tag/v2.0.0">release</a>.
</p>
</div>
</div>

<div id="outline-container-orgheadline9" class="outline-2">
<h2 id="foss"><a id="orgheadline9"></a><span class="section-number-2">9</span> FOSS 3.0</h2>
<div class="outline-text-2" id="text-foss">
<p>
Inputs from IIT Bombay ar awaited.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: <span class="timestamp-wrapper"><span class="timestamp">[2016-08-31 Wed]</span></span></p>
<p class="author">Author: VLEAD VLEAD</p>
<p class="date">Created: 2017-09-01 Fri 18:09</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
